posts/emacs-note/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs Note | Warren Liu</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://example.com/posts/emacs-note/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../git-note/" title="Git Note" type="text/html">
<link rel="next" href="../design-pattern/" title="Design Pattern Note" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Emacs Note">
<meta property="og:url" content="https://example.com/posts/emacs-note/">
<meta property="og:description" content="Emacs Notes


expend-region: require the module to be able to expand/shrink selections.

expend: C-=

shrink: M– C-= Note: M– is a negative prefix argument normally means -1.
this allow the er/expand-">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-14T00:00:00+01:00">
<meta property="article:tag" content="emacs">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Emacs Note</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-14T00:00:00+01:00" itemprop="datePublished" title="2017-07-14 00:00">2017-07-14 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Emacs Notes</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>
<code>expend-region</code>: require the module to be able to expand/shrink selections.
<ul class="org-ul">
<li>expend: C-=
</li>
<li>shrink: M– C-= <i>Note</i>: M– is a negative prefix argument normally means -1.
this allow the <code>er/expand-region</code> function to do a shrink.
</li>
</ul>
</li>

<li>repeat previous command: C-x z
</li>

<li>open ssh remote file:
<p class="verse">
C-x C-f /ssh:user@192.168.1.5:/usr/share/nginx/html/index.html<br></p>
<p>
Note the leading slash before ssh.
It support server defined in .ssh/config.
</p>
</li>

<li>This can also be used to Open file with sudo:
<p class="verse">
C-x C-f /sudo::/etc/fstab<br></p>
</li>

<li>Fill paragraph: with ~fill-paragraph~(M-q) to organize paragraph
with desired right margin.
</li>
</ul>
<ul class="org-ul">
<li>indent multiple line: <br>
  Select multiply lines, then type <code>C-u 8 C-x Tab</code>, it will indent the
region by 8 spaces.  <code>C-u -4</code> C-x Tab will <i>un-indent</i> by 4 spaces
</li>

<li>To input unicode characters:
<p class="verse">
C-x 8 RET unicode<br></p>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/emacs/" rel="tag">emacs</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../git-note/" rel="prev" title="Git Note">Previous post</a>
            </li>
            <li class="next">
                <a href="../design-pattern/" rel="next" title="Design Pattern Note">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
